<a href="https://colab.research.google.com/github/mjp002/Class/blob/master/Chapter7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))

In [17]:
df.iloc[:4, 1] = NA

In [18]:
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0 -0.207512       NaN       NaN
1 -2.049792       NaN       NaN
2  1.691300       NaN  0.608920
3 -1.551869       NaN -0.093938
4  0.851708  2.620257  1.106462
5  0.330634  0.368331  0.862235
6  1.529844 -0.418926  1.708293

In [20]:
df.dropna()

          0         1         2
4  0.851708  2.620257  1.106462
5  0.330634  0.368331  0.862235
6  1.529844 -0.418926  1.708293

In [22]:
df.dropna(thresh=2)

          0         1         2
2  1.691300       NaN  0.608920
3 -1.551869       NaN -0.093938
4  0.851708  2.620257  1.106462
5  0.330634  0.368331  0.862235
6  1.529844 -0.418926  1.708293

In [23]:
df.fillna(0)

          0         1         2
0 -0.207512  0.000000  0.000000
1 -2.049792  0.000000  0.000000
2  1.691300  0.000000  0.608920
3 -1.551869  0.000000 -0.093938
4  0.851708  2.620257  1.106462
5  0.330634  0.368331  0.862235
6  1.529844 -0.418926  1.708293

In [24]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.207512  0.500000  0.000000
1 -2.049792  0.500000  0.000000
2  1.691300  0.500000  0.608920
3 -1.551869  0.500000 -0.093938
4  0.851708  2.620257  1.106462
5  0.330634  0.368331  0.862235
6  1.529844 -0.418926  1.708293

In [25]:
df.fillna(0, inplace=True)

In [26]:
df

          0         1         2
0 -0.207512  0.000000  0.000000
1 -2.049792  0.000000  0.000000
2  1.691300  0.000000  0.608920
3 -1.551869  0.000000 -0.093938
4  0.851708  2.620257  1.106462
5  0.330634  0.368331  0.862235
6  1.529844 -0.418926  1.708293

In [27]:
df = pd.DataFrame(np.random.randn(6, 3))

In [28]:
df.iloc[2:, 1] = NA

In [29]:
df.iloc[4:, 2] = NA

In [30]:
df

          0         1         2
0 -1.490294  0.304214 -0.342785
1  0.875089 -0.662048 -1.242167
2 -1.111233       NaN -0.522284
3 -0.832635       NaN -1.226695
4 -0.225498       NaN       NaN
5 -1.555525       NaN       NaN

In [31]:
df.fillna(method='ffill')

          0         1         2
0 -1.490294  0.304214 -0.342785
1  0.875089 -0.662048 -1.242167
2 -1.111233 -0.662048 -0.522284
3 -0.832635 -0.662048 -1.226695
4 -0.225498 -0.662048 -1.226695
5 -1.555525 -0.662048 -1.226695

In [32]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.490294  0.304214 -0.342785
1  0.875089 -0.662048 -1.242167
2 -1.111233 -0.662048 -0.522284
3 -0.832635 -0.662048 -1.226695
4 -0.225498       NaN -1.226695
5 -1.555525       NaN -1.226695

In [36]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [41]:
data['v1'] = range(7)

In [42]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [44]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [45]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [48]:
lowercased = data['food'].str.lower()

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [54]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [55]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [58]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [59]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [61]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [62]:
transform = lambda x: x[:4].upper()

In [63]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [64]:
data.index = data.index.map(transform)

In [65]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [66]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [67]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [68]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [69]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [70]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [71]:
bins = [18, 25, 35, 60, 100]

In [72]:
cats = pd.cut(ages, bins)

In [73]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [75]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [76]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [77]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [78]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [79]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [82]:
df_with_dummy = df[['data1']].join(dummies)

In [84]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [85]:
val = 'a,b, guido'

In [86]:
val.split(',')

['a', 'b', ' guido']

In [87]:
pieces = [x.strip() for x in val.split(',')]

In [88]:
pieces

['a', 'b', 'guido']

In [89]:
first, second, third = pieces

In [90]:
first + '::' + second + '::' + third

'a::b::guido'

In [91]:
'::'.join(pieces)

'a::b::guido'

In [92]:
'guido' in val

True

In [93]:
val.index(',')

1

In [94]:
val.find(':')

-1

In [97]:
val.count(',')

2

In [98]:
val.replace(',', '::')

'a::b:: guido'

In [99]:
val.replace(',', '')

'ab guido'

In [100]:
import re

In [101]:
text = "foo     bar\t baz     \tqux"

In [102]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [103]:
regex=re.compile('\s+')

In [105]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [106]:
regex.findall(text)

['     ', '\t ', '     \t']

In [107]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [108]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [109]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [110]:
m = regex.search(text)

In [111]:
m

In [112]:
text[m.start():m.end()]

'dave@google.com'

In [114]:
print(regex.match(text))

None

In [115]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [120]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [121]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [122]:
m = regex.match('wesm@bright.net')

In [123]:
m.groups()

('wesm', 'bright', 'net')

In [124]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [125]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [126]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [127]:
data = pd.Series(data)

In [128]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [129]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [130]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [131]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [132]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [137]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [138]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object